<template>

  <div class="quote flex justify-center  items-center w-1/2 text-white">
     <p>{{showRandomQuotes()}}</p>
  </div>

</template>

<script>

export default {
        name:'quote',
            data: function(){
                return{
                quotes:[
                        'Рискуя, мы продлеваем молодость, не так ли?(Волк с Уолл-стрит)',
                        'Вещи, которыми ты владеешь, в конечном итоге овладевают тобой.(Бойцовский клуб)',
                        'Мы видим то, что ожидаем увидеть, а не обязательно правду.(Трасса 60)',
                        'Первая мысль - лучшая мысль.(Убей своих любимых)',
                        'Страх — лишь продукт твоих собственных мыслей.(После нашей эры)',
                        'Знать путь и идти по нему — не одно и то же.(Матрица)',
                        'Я понял, в чем ваша беда. — Вы слишком серьезны. Все глупости на Земле совершались именно с этим выражением лица... Улыбайтесь, господа... Улыбайтесь...(Тот самый Мюнхгаузен)',
                        'Если уж мечтать, то по-крупному.(Телепорт)',
                        'Мечты не бывают дурацкими.(Убойные каникулы)',
                        'Единственный человек, который стоит на твоем пути - это ты сама.(Чёрный лебедь)',
                        'Не признавать своих ошибок — самая опасная ошибка.(Двадцать одно)',
                        'Чтобы мир казался нормальным, надо быть сумасшедшим.(Алиса в стране чудес)'
                       ]
                    }
            },
            methods:{
                showRandomQuotes:function(){
                    var rand = Math.floor(Math.random() * this.quotes.length);
                    return this.quotes[rand]
                }
            }

}
</script>

<style>
.quote{
 font-style: italic;
}
</style>
